<a href="https://colab.research.google.com/github/marilynle/DS-Unit-2-Build/blob/master/Marilyn_Landim_Esko_Storytelling_Project_DS_Unit_2_Build_DATASET.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Microsoft (MSFT) stock price prediction

# Load data

In [0]:
import pandas as pd
import numpy as np

In [0]:
Data colected from yahoo finance on 11/12/2019

In [0]:
# Microsoft Corporation (MSFT)
df = pd.read_csv (r'C:\datasets\MSFT.csv') 

# Apply datetime to date column
df.loc[:, 'Date'] = pd.to_datetime(df['Date'],format='%Y-%m-%d')

# Sort by date in ascending order
df.sort_values(by='Date', inplace=True, ascending=True)

# Rename column Adj Close as msft
df.rename(columns={"Date":"date","Adj Close":"msft","Open":"open_msft","High":"high_msft","Low":"low_msft","Volume":"volume_msft"}, inplace = True)

# Drop column 'Close'
df = df.drop(columns=['Close'])

df.head()

        date  open_msft  high_msft   low_msft       msft  volume_msft
0 2000-11-13   33.34375   34.06250  32.203125  21.444250     83364800
1 2000-11-14   34.00000   34.90625  33.656250  22.210835     84218600
2 2000-11-15   34.53125   35.43750  34.343750  22.614307     60422200
3 2000-11-16   34.71875   35.75000  34.468750  22.251186     92128600
4 2000-11-17   34.71875   35.00000  33.898438  22.291533    106525600

In [0]:
# Apple Inc. (AAPL)
AAPL_df = pd.read_csv (r'C:\datasets\AAPL.csv') 
AAPL_df = pd.DataFrame(AAPL_df, columns= ['Adj Close'])
AAPL_df.head(2)

   Adj Close
0   1.204157
1   1.258539

In [0]:
df = df.join(AAPL_df)
df.rename(columns={"Adj Close":"aapl"}, inplace = True)
df.head(2)

,date,open_msft,high_msft,low_msft,msft,volume_msft,aapl
0,2000-11-13,33.34375,34.06250,32.203125,21.444250,83364800,1.204157
1,2000-11-14,34.00000,34.90625,33.656250,22.210835,84218600,1.258539

In [0]:
# Amazon.com, Inc. (AMZN)
AMZN_df = pd.read_csv (r'C:\datasets\AMZN.csv') 
AMZN_df = pd.DataFrame(AMZN_df, columns= ['Adj Close'])
AMZN_df.rename(columns={"Adj Close":"amzn"}, inplace = True)
AMZN_df.head(2)

      amzn
0  27.8125
1  28.9375

In [0]:
df= df.join(AMZN_df)
df.head(2)

,date,open_msft,high_msft,low_msft,msft,volume_msft,aapl,amzn
0,2000-11-13,33.34375,34.06250,32.203125,21.444250,83364800,1.204157,27.8125
1,2000-11-14,34.00000,34.90625,33.656250,22.210835,84218600,1.258539,28.9375

In [0]:
# Oracle Corporation (ORCL)
ORCL_df = pd.read_csv (r'C:\datasets\ORCL.csv') 
ORCL_df = pd.DataFrame(ORCL_df, columns= ['Adj Close'])
ORCL_df.rename(columns={"Adj Close":"orcl"}, inplace = True)
ORCL_df.head(2)

        orcl
0  21.645746
1  24.816080

In [0]:
df= df.join(ORCL_df)
df.head(2)

,date,open_msft,high_msft,low_msft,msft,volume_msft,aapl,amzn,orcl
0,2000-11-13,33.34375,34.06250,32.203125,21.444250,83364800,1.204157,27.8125,21.645746
1,2000-11-14,34.00000,34.90625,33.656250,22.210835,84218600,1.258539,28.9375,24.816080

In [0]:
# International Business Machines Corporation (IBM)
IBM_df = pd.read_csv (r'C:\datasets\IBM.csv') 
IBM_df = pd.DataFrame(IBM_df, columns= ['Adj Close'])
IBM_df.rename(columns={"Adj Close":"ibm"}, inplace = True)
IBM_df.head(2)

         ibm
0  64.482780
1  65.847733

In [0]:
df= df.join(IBM_df)
df.head(2)

,date,open_msft,high_msft,low_msft,msft,volume_msft,aapl,amzn,orcl,ibm
0,2000-11-13,33.34375,34.06250,32.203125,21.444250,83364800,1.204157,27.8125,21.645746,64.482780
1,2000-11-14,34.00000,34.90625,33.656250,22.210835,84218600,1.258539,28.9375,24.816080,65.847733

In [0]:
# Johnson & Johnson (JNJ)
JNJ_df = pd.read_csv (r'C:\datasets\JNJ.csv') 
JNJ_df = pd.DataFrame(JNJ_df, columns= ['Adj Close'])
JNJ_df.rename(columns={"Adj Close":"jnj"}, inplace = True)
JNJ_df.head(2)

         jnj
0  28.172709
1  28.645721

In [0]:
df= df.join(JNJ_df)
df.head(2)

,date,open_msft,high_msft,low_msft,msft,volume_msft,aapl,amzn,orcl,ibm,jnj
0,2000-11-13,33.34375,34.06250,32.203125,21.444250,83364800,1.204157,27.8125,21.645746,64.482780,28.172709
1,2000-11-14,34.00000,34.90625,33.656250,22.210835,84218600,1.258539,28.9375,24.816080,65.847733,28.645721

In [0]:
# CVS Health Corporation (CVS)
CVS_df = pd.read_csv (r'C:\datasets\CVS.csv') 
CVS_df = pd.DataFrame(CVS_df, columns= ['Adj Close'])
CVS_df.rename(columns={"Adj Close":"cvs"}, inplace = True)
CVS_df.head()

         cvs
0  21.310297
1  21.286823
2  20.254168
3  20.066416
4  19.690907

In [0]:
df= df.join(CVS_df)
df.head(2)

,date,open_msft,high_msft,low_msft,msft,volume_msft,aapl,amzn,orcl,ibm,jnj,cvs
0,2000-11-13,33.34375,34.06250,32.203125,21.444250,83364800,1.204157,27.8125,21.645746,64.482780,28.172709,21.310297
1,2000-11-14,34.00000,34.90625,33.656250,22.210835,84218600,1.258539,28.9375,24.816080,65.847733,28.645721,21.286823

In [0]:
# The Coca-Cola Company (KO)
KO_df = pd.read_csv (r'C:\datasets\KO.csv') 
KO_df = pd.DataFrame(KO_df, columns= ['Adj Close'])
KO_df.rename(columns={"Adj Close":"ko"}, inplace = True)
KO_df.head(2)

          ko
0  13.498687
1  13.388154

In [0]:
df= df.join(KO_df)
df.head(2)

,date,open_msft,high_msft,low_msft,msft,volume_msft,aapl,amzn,orcl,ibm,jnj,cvs,ko
0,2000-11-13,33.34375,34.06250,32.203125,21.444250,83364800,1.204157,27.8125,21.645746,64.482780,28.172709,21.310297,13.498687
1,2000-11-14,34.00000,34.90625,33.656250,22.210835,84218600,1.258539,28.9375,24.816080,65.847733,28.645721,21.286823,13.388154

In [0]:
# Target Corporation (TGT)
TGT_df = pd.read_csv (r'C:\datasets\TGT.csv') 
TGT_df = pd.DataFrame(TGT_df, columns= ['Adj Close'])
TGT_df.rename(columns={"Adj Close":"tgt"}, inplace = True)
TGT_df.head(2)

         tgt
0  18.296497
1  19.693838

In [0]:
df= df.join(TGT_df)
df.head(2)

,date,open_msft,high_msft,low_msft,msft,volume_msft,aapl,amzn,orcl,ibm,jnj,cvs,ko,tgt
0,2000-11-13,33.34375,34.06250,32.203125,21.444250,83364800,1.204157,27.8125,21.645746,64.482780,28.172709,21.310297,13.498687,18.296497
1,2000-11-14,34.00000,34.90625,33.656250,22.210835,84218600,1.258539,28.9375,24.816080,65.847733,28.645721,21.286823,13.388154,19.693838

In [0]:
# Walmart Inc. (WMT)
WMT_df = pd.read_csv (r'C:\datasets\WMT.csv') 
WMT_df = pd.DataFrame(WMT_df, columns= ['Adj Close'])
WMT_df.rename(columns={"Adj Close":"wmt"}, inplace = True)
WMT_df.head(2)

         wmt
0  31.713482
1  32.807064

In [0]:
df= df.join(WMT_df)
df.head(2)

,date,open_msft,high_msft,low_msft,msft,volume_msft,aapl,amzn,orcl,ibm,jnj,cvs,ko,tgt,wmt
0,2000-11-13,33.34375,34.06250,32.203125,21.444250,83364800,1.204157,27.8125,21.645746,64.482780,28.172709,21.310297,13.498687,18.296497,31.713482
1,2000-11-14,34.00000,34.90625,33.656250,22.210835,84218600,1.258539,28.9375,24.816080,65.847733,28.645721,21.286823,13.388154,19.693838,32.807064

In [0]:
# FedEx Corporation (FDX)
FDX_df = pd.read_csv (r'C:\datasets\FDX.csv') 
FDX_df = pd.DataFrame(FDX_df, columns= ['Adj Close'])
FDX_df.rename(columns={"Adj Close":"fdx"}, inplace = True)
FDX_df.head(2)

         fdx
0  40.674557
1  41.105827

In [0]:
df= df.join(FDX_df)
df.head(2)

,date,open_msft,high_msft,low_msft,msft,volume_msft,aapl,amzn,orcl,ibm,jnj,cvs,ko,tgt,wmt,fdx
0,2000-11-13,33.34375,34.06250,32.203125,21.444250,83364800,1.204157,27.8125,21.645746,64.482780,28.172709,21.310297,13.498687,18.296497,31.713482,40.674557
1,2000-11-14,34.00000,34.90625,33.656250,22.210835,84218600,1.258539,28.9375,24.816080,65.847733,28.645721,21.286823,13.388154,19.693838,32.807064,41.105827

In [0]:
df.shape

(4778, 16)

In [0]:
df.dtypes

date           datetime64[ns]
open_msft             float64
high_msft             float64
low_msft              float64
msft                  float64
volume_msft             int64
aapl                  float64
amzn                  float64
orcl                  float64
ibm                   float64
jnj                   float64
cvs                   float64
ko                    float64
tgt                   float64
wmt                   float64
fdx                   float64
dtype: object

In [0]:
# Checking for null values
df.isnull().sum()

date           0
open_msft      0
high_msft      0
low_msft       0
msft           0
volume_msft    0
aapl           0
amzn           0
orcl           0
ibm            0
jnj            0
cvs            0
ko             0
tgt            0
wmt            0
fdx            0
dtype: int64

In [0]:
# summary stats
print(df.describe())

         open_msft    high_msft     low_msft         msft   volume_msft  \
count  4778.000000  4778.000000  4778.000000  4778.000000  4.778000e+03
mean     41.602737    42.002494    41.194346    35.840448  5.458902e+07
std      27.160511    27.335819    26.925945    29.080210  3.082706e+07
min      15.200000    15.620000    14.870000    11.771113  7.425600e+06
25%      26.370001    26.660000    26.066251    18.945807  3.278650e+07
50%      29.345000    29.650000    29.010000    22.344021  4.995810e+07
75%      45.387501    45.695000    45.002500    40.967460  6.797492e+07
max     145.339996   146.419998   144.729996   146.110001  5.910522e+08

              aapl         amzn         orcl          ibm          jnj  \
count  4778.000000  4778.000000  4778.000000  4778.000000  4778.000000
mean     56.676330   365.203626    25.490906   101.226879    64.691227
std      61.386495   513.445534    13.381424    37.135416    33.373435
min       0.815409     5.970000     6.401894    36.825249    25.545528
25%       5.696986    40.924998    13.024618    63.862595    40.464865
50%      30.895425   130.269997    22.390128    94.809746    47.628464
75%      93.403050   384.647499    36.819360   137.291782    88.916710
max     262.200012  2039.510010    59.641491   167.242981   144.782944

               cvs           ko          tgt          wmt          fdx
count  4778.000000  4778.000000  4778.000000  4778.000000  4778.000000
mean     40.601963    24.371592    45.683253    52.857089   106.364977
std      25.130187    12.640690    17.228988    20.092679    54.144649
min       8.517931     8.803715    18.296497    30.879402    30.952911
25%      21.983009    12.341358    33.096942    37.713664    70.030728
50%      30.288974    19.322445    41.594406    42.861773    87.512119
75%      63.359267    35.396586    55.406506    65.721882   145.516300
max     101.768234    55.365208   113.680000   120.239998   268.354980

# Export the DataFrame to a CSV file

In [0]:
df.to_csv(r'C:\datasets\stocks_df.csv')